# Merge

In [6]:
import pandas as pd

var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,4], "C":[23,22,33,44]})

pd.merge(var1, var2, on="S")

   S   B   C
0  1  11  23
1  2  22  22
2  3  33  33
3  4  44  44

In [7]:
# it only give the merge on the common data

var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.merge(var1, var2, on="S")

   S   B   C
0  1  11  23
1  2  22  22
2  3  33  33

In [8]:
# inner, left, right methods using the how parameter

var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.merge(var1, var2, how= "inner")

   S   B   C
0  1  11  23
1  2  22  22
2  3  33  33

In [20]:
var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.merge(var1, var2, how= "left",)

   S   B     C
0  1  11  23.0
1  2  22  22.0
2  3  33  33.0
3  4  44   NaN

In [21]:
var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.merge(var1, var2, how= "right", left_index = True, right_index = True,  suffixes = ("name","python"))

   Sname   B  Spython   C
0      1  11        1  23
1      2  22        2  22
2      3  33        3  33
3      4  44        5  44

In [14]:
var1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
var2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.merge(var1, var2, how= "outer", indicator = True)

   S     B     C      _merge
0  1  11.0  23.0        both
1  2  22.0  22.0        both
2  3  33.0  33.0        both
3  4  44.0   NaN   left_only
4  5   NaN  44.0  right_only

# Concat

In [22]:
# lets create two series and concat them

sr1 = pd.Series([1,2,3,4])
sr2 = pd.Series([11,22,32,42])

pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
0    11
1    22
2    32
3    42
dtype: int64

In [23]:
d1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
d2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.concat([d1,d2])

   S     B     C
0  1  11.0   NaN
1  2  22.0   NaN
2  3  33.0   NaN
3  4  44.0   NaN
0  1   NaN  23.0
1  2   NaN  22.0
2  3   NaN  33.0
3  5   NaN  44.0

In [30]:
# Handle this missing data using the join Parameter

d1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
d2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.concat([d1,d2], join="inner")

   S
0  1
1  2
2  3
3  4
0  1
1  2
2  3
3  5

In [32]:
# Creating the key of the concat of the datafrmes

d1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
d2 = pd.DataFrame({"S":[1,2,3,5], "C":[23,22,33,44]})

pd.concat([d1,d2], join="outer", keys = ["d1", "d2"])

      S     B     C
d1 0  1  11.0   NaN
   1  2  22.0   NaN
   2  3  33.0   NaN
   3  4  44.0   NaN
d2 0  1   NaN  23.0
   1  2   NaN  22.0
   2  3   NaN  33.0
   3  5   NaN  44.0

In [26]:
# Concat along column axis

d1 = pd.DataFrame({"S":[1,2,3,4], "B":[11,22,33,44]})
d2 = pd.DataFrame({"S":[1,2,3,5], "B":[23,22,33,44]})

pd.concat([d1,d2], axis =1)

   S   B  S   B
0  1  11  1  23
1  2  22  2  22
2  3  33  3  33
3  4  44  5  44